#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_vpc.main: Refreshing state... [id=vpc-0dcee13c71f063543]
data.aws_availability_zones.all: Reading...
aws_iam_policy.ssm_policy: Refreshing state... [id=arn:aws:iam::619568494776:policy/global-ssm-parameter-store]
data.aws_availability_zones.all: Read complete after 1s [id=us-east-1]
aws_iam_role.role-launch-ec2: Refreshing state... [id=prod-role-launch-instance]
aws_iam_instance_profile.ec2-instance-profile: Refreshing state... [id=prod-iam-instance-profile]
aws_internet_gateway.igw: Refreshing state... [id=igw-0af35376874190c30]
aws_subnet.public-subnet[0]: Refreshing state... [id=subnet-0aa05051bfa7feef5]
aws_subnet.public-subnet[4]: Refreshing state... [id=subnet-0765a747d29bb6fe9]
aws_subnet.private-subnet[2]: Refreshing state... [id=subnet-0f37ba5b6d495edfc]
aws_subnet.private-subnet[4]: Refreshing state... [id=subnet-0ef79d34b13425a88]
aws_subnet.public-subnet[5]: Refreshing state... [id=subnet-0e8a3f0b6eb3ded9f]
aws_subnet.public-subnet[1]: Refreshing state... [id=subnet-044ba473937913edc]
aws_subnet.private-subnet[3]: Refreshing state... [id=subnet-0897e77d270f6214b]
aws_subnet.public-subnet[2]: Refreshing state... [id=subnet-072158ae7b7d1bdc6]
aws_security_group.sg: Refreshing state... [id=sg-0f84910f03ed7e1da]
aws_subnet.public-subnet[3]: Refreshing state... [id=subnet-04a613d851d85233b]
aws_subnet.private-subnet[5]: Refreshing state... [id=subnet-048b788eb8474ab21]
aws_subnet.private-subnet[0]: Refreshing state... [id=subnet-015a7bdb7aa2ad0e7]
aws_route.public_subnets_igw[3]: Refreshing state... [id=r-rtb-002d90f87ad8622771080289494]
aws_subnet.private-subnet[1]: Refreshing state... [id=subnet-060a1313ea73b34d1]
aws_route.public_subnets_igw[4]: Refreshing state... [id=r-rtb-002d90f87ad8622771080289494]
aws_route.public_subnets_igw[5]: Refreshing state... [id=r-rtb-002d90f87ad8622771080289494]
aws_route.public_subnets_igw[1]: Refreshing state... [id=r-rtb-002d90f87ad8622771080289494]
aws_route.public_subnets_igw[0]: Refreshing state... [id=r-rtb-002d90f87ad8622771080289494]
aws_route.public_subnets_igw[2]: Refreshing state... [id=r-rtb-002d90f87ad8622771080289494]
aws_route_table_association.public_subnets_association[0]: Refreshing state... [id=rtbassoc-0e01d27c252c6cc27]
aws_route_table_association.public_subnets_association[1]: Refreshing state... [id=rtbassoc-03b4862c5531e112e]
aws_route_table_association.public_subnets_association[2]: Refreshing state... [id=rtbassoc-0c92e5dadcc0edc86]
aws_route_table_association.public_subnets_association[3]: Refreshing state... [id=rtbassoc-0eade0005b29df706]
aws_route_table_association.public_subnets_association[4]: Refreshing state... [id=rtbassoc-0754fe23725f6f60e]
aws_route_table_association.public_subnets_association[5]: Refreshing state... [id=rtbassoc-0d6532c379cc5eee7]
aws_launch_configuration.alc: Refreshing state... [id=prod-remix-recipe-launch-configuration-20230211231107226000000001]
aws_elb.elb: Refreshing state... [id=prod-remix-recipe-load-balancer]
aws_autoscaling_group.asg: Refreshing state... [id=prod-remix-recipe-auto-scaling-group]
aws_autoscaling_attachment.asg_elb: Refreshing state... [id=prod-remix-recipe-auto-scaling-group-20230211231122655900000002]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_autoscaling_group.asg will be updated in-place
  ~ resource "aws_autoscaling_group" "asg" {
        id                        = "prod-remix-recipe-auto-scaling-group"
      ~ launch_configuration      = "prod-remix-recipe-launch-configuration-20230211231107226000000001" -> (known after apply)
      ~ load_balancers            = [
          - "prod-remix-recipe-load-balancer",
        ]
        name                      = "prod-remix-recipe-auto-scaling-group"
        # (21 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_launch_configuration.alc must be replaced
+/- resource "aws_launch_configuration" "alc" {
      ~ arn                              = "arn:aws:autoscaling:us-east-1:619568494776:launchConfiguration:1611275b-fc19-4610-a7e9-8a99f628ba53:launchConfigurationName/prod-remix-recipe-launch-configuration-20230211231107226000000001" -> (known after apply)
      ~ ebs_optimized                    = false -> (known after apply)
      ~ id                               = "prod-remix-recipe-launch-configuration-20230211231107226000000001" -> (known after apply)
      + key_name                         = (known after apply)
      ~ name                             = "prod-remix-recipe-launch-configuration-20230211231107226000000001" -> (known after apply)
      ~ user_data                        = "ca261db9897435df2e76d22654179a468eef0bd6" -> "ae886f65f587d9031fc3ae5fe8b041ab596c4535" # forces replacement
      - vpc_classic_link_security_groups = [] -> null
        # (7 unchanged attributes hidden)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + no_device             = (known after apply)
          + snapshot_id           = (known after apply)
          + throughput            = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      ~ root_block_device {
          ~ encrypted             = false -> (known after apply)
          ~ iops                  = 0 -> (known after apply)
          ~ throughput            = 0 -> (known after apply)
            # (3 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @shubhamcommits, Action: `pull_request`*